apps/load-tests/tests/scenarios/full-models-tree-stateless.yml
config:
  target: "http://127.0.0.1:5001/presentation-test-app/v1.0/mode/1/context/00000000-0000-0000-0000-000000000000/imodel/00000000-0000-0000-0000-000000000000/changeset/0"

  phases:
    - name: "1 user"
      duration: 1
      arrivalRate: 1

  payload:
    path: "./datasets.csv"
    name: "iModels"
    loadAll: true

  processor: "../lib/processors/models-tree-stateless.js"

scenarios:
  - name: Full Models Tree (stateless)
    beforeScenario: "initScenario"
    afterScenario: "terminateScenario"
    flow:
      - loop:
          - function: "loadFullHierarchy"
        over: iModels